#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "23891e94660fc3974b07f94d8b7747ff" -> "8e9d6c356501e10c74b36b465c838a86"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "43fb6061602ac5b5bf382d2bdac236c9" -> "3bf3718f7a4e4c8295e0ae430a771469"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "0dfa3997ea5e8752c9398461462dcdf1" -> "21f877ad2d9f19e8a33afe17ec95d8eb"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "305e7b1d742df25ae3f99f67a3abeb99" -> "4f5f21041c6956ab9ebd11b45b2a6769"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d0806073b0462a98b405677f329955a7" -> "b9497ab74f948ab9b4c594bea1c02c25"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "b9c1f5196e8cf334925810dc8724f4cf" -> "67c7c83e0f757f3a65294b7a0def8ad6"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "b22ec61bb24505fc5bf6ef732a475300" -> "3d8f772e4d32c8159269f6d8e4f131d2"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "7133673da016ab2a6a4929c1f9bb877b" -> "b5b58236b94df7f25f0b01a014791c8f"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a58424c8ae6702290e51d84a93a43eee" -> "66f38a68aaf28707b4ece48dff1375a5"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "91a66ffa124d7be71b00ccb87ab21e74" -> "54a7f325710bceda63a549a2aec2c560"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "0be5a3d661c41e816abe2d2b29340233" -> "5a82a4396958e006f4c975293fd32519"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "3a54d2d7d691cccd2693db079f885f2d" -> "2d8767e7d55910c03cd446223b43b056"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "7935b6700026680154e43e318701c419" -> "41d5cbc98ad4281eb687b531981e1e0b"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "28b74021c6cbe65b191856b38c20dcfb" -> "f60f57a087f32fff683f2c3b99111bcb"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b64238a5612250bc25cdad6103ae511a" -> "d144fad47961ee61cbd1298855f04b05"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "8710c9e66b25cb266ded1a81b23d152c" -> "08a46c448a6abc439a59892706fc3623"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "b905af015ea7cc1051e06978a98f6446" -> "5c2198dbe5c7c23cd6ae525dc224497a"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "e4ee69051a1b4c488c138cc94a00f3a9" -> "27c9bebda80ec75ea2ddb87ea07071d5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f221b659954cacdc84718ee3019cdb85" -> "2da0e5f1baefbabaad83e8f663f0ab2e"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "effbfec5527b18ed7a961d486e3fca85" -> "c9f57f2a538b6dabde55134ef8ecaac2"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "24f0c969d49d091945c0a2b04b93f481" -> "c5c82d35ea572bf05362424291adb9cd"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "6b70c0abf6b8ea57516d3786992cf6cc" -> "126cd4d2c8214bbaaddcdb7dc687ec14"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "5f4a43af5af4ac4de255db61567494ab" -> "77f6120c528b82cea960f12e6501c404"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "6eb61f385d307fb6d4e48cce303277cd" -> "34bedb72827c63b5ddcbbe902f057878"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "7b24218ebf4819658d81c82b5348df9f" -> "624d872e73159be00680e9c5075bdea3"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1b6986a6f4fd199371fae24f6939d23f" -> "02c216536f53bebb9207fc272f7b4555"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "204e66eb2e3d5f157fa3cd3aab30c6b8" -> "55fcfbaa726a73c5f3a470d33a851053"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "5bc352e1d017449c8e0581beeffd06d9" -> "61b1972331f553b6ad9b25884e0a6567"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "8161348dd5e902c3cdc363e11bd0238d" -> "5bd9c95294d508af5ad2d52403c85daf"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "f5f4acf605a3689984120a30c5a275c8" -> "cd531429c40ffb810925b1d84e3ebfb2"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "403352386718d38d6268b98b6367ff10" -> "1a5c2be8bdf6531ec32f7735b2c5f28f"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "ec8dbe1b467f3ef7ced9a3625ea42b6a" -> "1e9a1583ad06e15d472e435cec73d8e0"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6a31330cf85e2065b6eb62c75aa98b2e" -> "48b0541741ad9808cfb11a1818d91085"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "96d910c50a2d2c36345deeab022a8d77" -> "e0d7cc6b562d3045a0aa98ecf77df81b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "e976972942742b13df33325b2247d100" -> "fc27ee50f3e5dfb146e8ac14791d15ac"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "0feaa67a5af7c06a3152de853038f452" -> "9f9b07c3ec87305cff136013e2309c70"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "516950428b7bd11be72fef2b19552b28" -> "0f9c3342a5bb42aca44a5b3723896ca8"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "8a435b92e470202cc094598e515873cf" -> "c663ad523d1c1da2e8cc50a814c740ad"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2d590580d393eedce5148961adedb66f" -> "0443ddb30fdd5e3409be7e26cbfbbdda"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "f24f7f4c9b5c475984f5a82f221ac56f" -> "86a99055b4d50ec2689293cb8ae416fe"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "290b2167cff29246f39b67df075a452e" -> "ce847fa0e353c6788aaa0c41d032598b"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "790b888e9c1053cf5a16df0d0975f1a2" -> "45f05d37d95b1afaab60c90f4c85bf33"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "a18eeb90574fb84689335a958d11d8bb" -> "d3c7682a7f620ad1f555afdbb7831777"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "1fa997b45de13152d7c2f0d98b69bc1d" -> "53cd91d871141053f5e03c63609a6a3b"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "445164fc122817a5d771d25da36b2d69" -> "41e9456cc3743da0258a468774f6404d"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "2e1ebf3c85c2f512beb18a0e51f07382" -> "11a35041f0e36ec42abef947ef490af7"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "3GQsYvJpRNeg7AtO9Ii1s/ihvgrQt//PUekTKknP8rA=" -> "fDq7zGrmskafwZOZm19230eDM9ZriGXO+oljaGq68hs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gFmz9MN/dsbvVfz6P9Qpa2iLxOWPR1KjCGxfWNtb6u4=" -> "EDXPpciOxMsYAo4TzeFT7k+6qUtP8fRD8/xqMKNn9us="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "3KYbZCEih2yu0ZpetyiI7wIfP/5aAnTaTadZrLr0EyY=" -> "In5zpxgKYBZaYYO7Zwvb9Ck7nJv9HmXKFkfzEFegtaU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "+5oJXvLY84g4LdPq75H7DmgkC5s/4JZp6ZTgBmutnaQ=" -> "AusItJr2stDtYLL+eYpo06n1IrDwcCYTfiEml886pJs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "2QNbKgSfqmSXaxsNnb7YdHrLf+J/NYdqjOvjRL/+JeI=" -> "gBKfVPIxj2SuBrtJDufSNWY5v6bGnOnyZni4tdXzeqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV3CmkNpuxZlXD2EjACiKTwAUYiYE9jTrWcTkkBLmcs=" -> "8e3NHDHL4tGQxaHpPeokDUfQ1uaeKj1No2BT65Q5OGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "rArqnkkfnAgjhxLYD8xOAE0VZ2rqxVo8VIHQoowstmE=" -> "r0xz0Hq5j5pFE6imtjURaZbvi65uMVKFW1KzdXYN1wo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "VMjPnCflgtaiq6g9pq5YYo08HYltYP3NaBSnVPFDpRU=" -> "4xlDHt6LVvP2/aAc+WkCEeTA62rT9egR4SwVW4mzFwk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "0vZYbRvMGY/pVekA9ZOllfNShPOw+KidZITezW9gv4g=" -> "nvh0Ipwdo8BwKRAp8FjzYL11c8TisdQllO2YSpenvsk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "74n+KPrdp7se2ZJEzE5o3ChFsWSomxq3jSrGXrT8D7M=" -> "4YK69XSdqD+ze/dXNWMKkE/j5g/qdJQQO0pq4ztv9i4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "iGmGlZ+TFHQ2ViA2RCP4kiwd3Wwx+EhqoLi46Pgmm9o=" -> "QNeeC4VLci1mLhR+eqtjPJZPN2hqHliHeLelI7y5wlM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "YOQxWwF0CmeU4dzsIiBRMmpbsNyFivF49Px+ACSvKfM=" -> "Tw/0IkpZknu38ItM/LVMTCnO9J+zLez85dBgvc8TrFE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEGHwZwk2XQeHfMykZ1BRPrXuYFYCXIBN1z3Z2PYq2U=" -> "wrTrgw8zC6JPxI1LmYOMUEvzLcYQgS6uP6S41rXtmag="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "lWAhiWXKUbyVF19vrsHtQSmMVvrIQF4YxPFvmp8e48k=" -> "n9LMaWUihY/Zsyp7ROxKWI3lwNWh9EwpQWZdyAQhNWQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "2psBkOGN4dfUJIFg31C5Cp3kSCT/I577TxkD4x9TmjE=" -> "CwEchMceYs1LMRl+TVLo23R+7r3HQimpVrjlfTYQbo4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPWf9wyg5s+OSTX1PWvYLBhihVhjGhcviUA5xQL3BEw=" -> "LMDk/ividR7dRMF9YY5MBARvMNPC1oAXqLbyGB45ieU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "BHHEpJE8koE9LIP4WfxUCIQkdbA7Kk1Uy8mo5YPLORQ=" -> "DGt5v7Spq0PaD5ezOKOxGHkbqHoixfDn9Mz81ZXE40Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "HdL7uw5gUIgZ4gYjEEvd1ryeH4/qR+jc1glccPSzF/w=" -> "lc2faN0MeHrJedGCWbtvUuqTm5KfkmTUAhsdMIeIWOo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "8AjloweViuAKUB06jaKAy3NcWqKO/PTOCJQ56+vopQE=" -> "eDVE0JH0YhahU7nCx5WdsKGpGrArJdMfWy33sP599NM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "A2SuiZXnPt5BNzxPDuvOD9mZ9Cg/AzDXvFAZ3PDjwxk=" -> "3Bqe4nkDYEtN3W4FR3GbA7R4oKMrtsOkcpTSinPhRVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "wz5QSrrfK6QThFBrlJBhhe0gObU2/pUCiUXLp+1T0hs=" -> "jFaHLo6hyLA778CBqGBDB7yYXhOYToEJXawpbpvUO8Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "LkWLP3J+2+qZZLSHqgOMWAVT3oU4tOZIu1e8HZWk/Ns=" -> "tJ/nJW1GZAXxx33fP4/Pus8/J02owDpQuvvhyOcpixQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "o97Yo2jNHWbhSS24scK/YksaEBiSRyqa9gFmB3Ei+Tw=" -> "X2GkIz/yF8Mi8XnMWDxNom5pqnqDpgiDVuEP+7eZidY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "AAKaCozxH6K8lIohjgaKaVlZg4UIQNxvJnAivMKMMkk=" -> "7tZwymgkU80gsEmv4lXlMHH3giXlw+HCec+epj3KRiM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "JOmyEiiML6XP/JSIip7+SSiqlquNQnB+ARx9MpN1dNw=" -> "GXD6jFeYUD8hXho0by8FAnhm/+6Bi+v3q7ehjEx4AIM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "ARjyvQXZ7US9Ekipz38r+3Lb8cKQokaFF1dHLdqHr6k=" -> "qCJ2fX5MwrP8nIlm2+JhVNF1CV6HULGfpoTKN2gRNSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "V27jRf4FkLJKfZqw/qV6wg3UtPsWf4xgD9qVGrWsDOg=" -> "5Wr8eb7QUEn63sM3J6XLNFNueoKEihBe6ozPvHG2ClY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PTJwcroAKpiiZb6Kff/0i5UTkhslApxdk+81jWgV7xA=" -> "+rSmhqw/nbnwGgASx8Q40uJV45MG1QKjt8PsfLlCjYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "7fP96KvBQVvLsFl4OeaH4jYmriyUGaAgnYUv5mrOO6E=" -> "ZoF9MkmuF33azpvY5thLcLmGGxSHu6U7r+GPtYUl/Os="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "rQ6ezOcQC7owLQlY0yVKUxadPusLLvpoeiIB0fplLVQ=" -> "UeAXr/zjyBx5jknQvC6rVydJ6u/EfuCCajzxorYsHY8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zuHB78H7DnfwJOL4ITHkAgrunypCw+8b7PLRRVo+raM=" -> "ppD7XaYcVVuGuWgy/gc/J/DyN47jxMkNCi7EJO4f/Gw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbC7pQcIfF0qd6PPW5/9ztcArU3lmpxZMhT7eetINk4=" -> "u5xJ0xPNY/yr+6d7Zxe/RjUsC1tpqElYfmQiMuwmhjo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pC6I3CMItfEGMp7CSzK46sGFSYHRsOr9P9wmySSWkE8=" -> "etrdaVnpDeAi3C/ba/ZD4GoeAGT86CdOvGaT8WTdlkA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "6AXGtSvWAptbt5rowppAzUc+Id92Hh9vnKUExMC4dLY=" -> "udadYWjYpQA+kA3VfqkD0yWhuvBCNfhhGPW4sVi6/y4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mxQQR7miCrqEz8xlgzqfIO7cwTLcRddw/hfgAinu5gI=" -> "mu7Ki6ci4BcM8BwEtcFgJBzuBpXIw1oGuvQ+PYBSOrQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "/92frkvR6tAIKDRruX4c/IhCa6In7w+P9aW00KU/gqI=" -> "N+GSyuK+ajhZDllQK7hPEZ5G1FVF3PnLgwEhctMNwCE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "TnKjDiwxi3RCMcpJi+keCCpNSjd6FZqu7LyBA8PDWXI=" -> "Srr/9odkpWEp0Jg+M9wsWfGws7J9qY1d2ULIZ0YA8As="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "vj1AUsuYCwixuTeJB7bTg6lhZbCcmlxh9fqJhn51HJc=" -> "mNlZKLHgjpTri6lHhHNtIwy/ScWSfHzeV7VR87UGjcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "NfaSn8PxRvmT66wakBnpAwq4PzchM6VsscArROGSu10=" -> "kzfJWhAGph8tu5kBYKOEnQrOAQt5OArJuG1ZwTPT7IY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "jQXXKhAyYg2Hk1y6A/mJONr3+ffFuUjXVrJ3YOPnG2o=" -> "0M5h6hjLOkbbQj7qBRWEBvL9UYJUdDMqGjFleMC4tXU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "QpQp1L2BG5wKG9OXGP2V4Odw+2m1JF0w793YQEqq+vY=" -> "VlMp4nl/MQzjku8ObIHFyq/hGUJcGhD9SOk1WW51c6I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Go2tFYt/NPu6npblUHdc5YSPc9Yau3iLLO1ALvwDW/8=" -> "1pxlDKuhyAtB/RPBeo6lRtZn/xBuZNo/xFbJYfThcLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T15:01:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "XjZHOIoCyba0nGt4U+AdDaaDu9ppctoDxko07nM05co=" -> "DE6/+zAkMd1ej/sa4TSOlNVSOBS1zM7JhzclXSLT2JI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "3unJ4fhnzODmQH7hBcAb0dfxo2hUqNMHy9+N8OBTTwM=" -> "yNmB5TPx3Pxa9Vq5Ju3msHSP7VE7m0MAVZOwKYocWoc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T15:00:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "aHK7b41HwYyo3NZMCt0gRJ/27GSoPxeJbXrq8IwONTw=" -> "DpDqemlt3K9bGaa6eq9fhbOTiPRHqPMZvxy4RzwAJpw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T15:00:18Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "z5xiui" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T15:00:17Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T15:00:16Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*